# Capstone Project-5
## Domain:
- Marketing for Financial Services
## Title:
- Exploratory Data Analysis and Predictive Modeling for Marketing Term-Deposit Scheme in the Financial Services Industry
## About:
- DB Bank is a large public sector bank that has branches across the cities. It provides various services like savings accounts, current accounts, term deposits, personal loans, home loans, etc. to customers. Whenever the bank conducts marketing on its new schemes, it will keep track of data related to customers’ personal, social, and economic details. Also, it maintains the detailing of efforts made to achieve success in the campaign. Recently, the bank has conducted a campaign to market its term-deposit scheme. Campaigns were conducted based mostly on direct phone calls, soliciting the bank's customers to place  a term deposit. After all the marketing efforts, if the client had agreed to place a deposit, then the campaign is a success, otherwise not (Target variable marked 'yes', or 'no').

## Importing libraries

In [55]:
import pandas as pd      # Data manipulation and analysis
import numpy as np       # Mathematical functions and arrays
%matplotlib inline 
import matplotlib.pyplot as plt   # Basic plotting
import seaborn as sns     # Statistical data visualization
import plotly.graph_objects as go   # Interactive plots
import plotly.express as px   # Expressive visualizations
import folium     # Geospatial data visualization

## Importing datasets and data cleanup

In [56]:
Y = pd.read_csv('Customer_Response_data_p1.csv') # the output (Yes/No) Used
Customer_and_bank_details_p1 = pd.read_csv('Customer_and_bank details_p1.csv') #  Used
Customer_campaign_details_p1 = pd.read_csv('Customer_campaign_details_p1.csv') # Used
Customer_Postal_Code_detail = pd.read_csv('Customer_Postal_Code_details.csv') # used
Customer_social_economic_data_p1 = pd.read_csv('Customer_social_economic_data_p1.csv')
State_Master = pd.read_csv('State_Master.csv')
Region_code_master = pd.read_csv('Region_code_master.csv')
City_Master = pd.read_csv('City_Master.csv')

## Exploring data
In this section we explore the different datasets and how they are related.

In [57]:
Customer_and_bank_details_p1.head(3)

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
0,1,56,services,married,high.school,no,no,yes,3,S1,C1
1,2,45,services,married,basic.9y,unknown,no,no,3,S1,C1
2,3,59,admin.,married,professional.course,no,no,no,4,S2,C2

In [58]:
for column in Customer_and_bank_details_p1.columns:
	print(column," ",Customer_and_bank_details_p1[column].unique())
	print("---------------------------------------------------")

Customer_id   [    1     2     3 ... 37082 37083 37084]
---------------------------------------------------
age   [56 45 59 41 24 25 29 57 35 54 46 50 39 55 37 49 34 52 58 32 38 44 42 40
 60 53 47 51 48 33 31 43 36 28 30 27 22 26 23 20 21 61 19 18 70 66 76 67
 73 88 95 77 68 75 80 62 63 65 72 82 64 71 69 78 85 79 83 81 74 17 91 86
 98 94 84 92 89]
---------------------------------------------------
job   ['services' 'admin.' 'blue-collar' 'technician' 'housemaid' 'retired'
 'management' 'unknown' 'entrepreneur' 'unemployed' 'student'
 'self-employed']
---------------------------------------------------
marital   ['married' 'single' 'divorced' 'unknown']
---------------------------------------------------
education   ['high.school' 'basic.9y' 'professional.course' 'unknown' 'basic.4y'
 'basic.6y' 'university.degree' 'illiterate']
---------------------------------------------------
default   ['no' 'unknown' 'yes']
---------------------------------------------------
housing   ['no' 'yes' 'unknown']
---------------------------------------------------
loan   ['yes' 'no' 'unknown']
---------------------------------------------------
Region_Code   ['3' '4' 'Na' '1' '2']
---------------------------------------------------
State_Code   ['S1' 'S2' 'S3' 'S4' 'S5' 'S6' 'S7' 'S8' 'S9' 'S10' 'S11' 'S12' 'S13'
 'S14' 'S15' 'S16' 'S17' 'S18' 'S19' 'S20' 'S21' 'S22' 'S23' 'S24' 'S25'
 'S26' 'S27' 'S28' 'S29' 'S30' 'S31' 'S32' 'S33' 'S34' 'S35' 'S36' 'S37'
 'S38' 'S39' 'S40' 'S41' 'S42' 'S43' 'S44' 'S45' 'S46' 'S47' 'S48' 'S49']
---------------------------------------------------
City_Code   ['C1' 'C2' 'C3' 'C4' 'C5' 'C6' 'C7' 'C8' 'C9' 'C10' 'C11' 'C12' 'C13'
 'C14' 'C15' 'C16' 'C17' 'C18' 'C19' 'C20' 'C21' 'C22' 'C23' 'C24' 'C25'
 'C26' 'C27' 'C28' 'C29' 'C30' 'C31' 'C32' 'C33' 'C34' 'C35' 'C36' 'C37'
 'C38' 'C39' 'C40' 'C41' 'C42' 'C43' 'C44' 'C45' 'C46' 'C47' 'C48' 'C49'
 'C50' 'C51' 'C52' 'C53' 'C54' 'C55' 'C56' 'C57' 'C58' 'C59' 'C60' 'C61'
 'C62' 'C63' 'C64' 'C65' 'C66' 'C67' 'C68' 'C69' 'C70' 'C71' 'C72' 'C73'
 'C74' 'C75' 'C76' 'C77' 'C78' 'C79' 'C80' 'C81' 'C82' 'C83' 'C84' 'C85'
 'C86' 'C87' 'C88' 'C89' 'C90' 'C91' 'C92' 'C93' 'C94' 'C95' 'C96' 'C97'
 'C98' 'C99' 'C100' 'C101' 'C102' 'C103' 'C104' 'C105' 'C106' 'C107'
 'C108' 'C109' 'C110' 'C111' 'C112' 'C113' 'C114' 'C115' 'C116' 'C117'
 'C118' 'C119' 'C120' 'C121' 'C122' 'C123' 'C124' 'C125' 'C126' 'C127'
 'C128' 'C129' 'C130' 'C131' 'C132' 'C133' 'C134' 'C135' 'C136' 'C137'
 'C138' 'C139' 'C140' 'C141' 'C142' 'C143' 'C144' 'C145' 'C146' 'C147'
 'C148' 'C149' 'C150' 'C151' 'C152' 'C153' 'C154' 'C155' 'C156' 'C157'
 'C158' 'C159' 'C160' 'C161' 'C162' 'C163' 'C164' 'C165' 'C166' 'C167'
 'C168' 'C169' 'C170' 'C171' 'C172' 'C173' 'C174' 'C175' 'C176' 'C177'
 'C178' 'C179' 'C180' 'C181' 'C182' 'C183' 'C184' 'C185' 'C186' 'C187'
 'C188' 'C189' 'C190' 'C191' 'C192' 'C193' 'C194' 'C195' 'C196' 'C197'
 'C198' 'C199' 'C200' 'C201' 'C202' 'C203' 'C204' 'C205' 'C206' 'C207'
 'C208' 'C209' 'C210' 'C211' 'C212' 'C213' 'C214' 'C215' 'C216' 'C217'
 'C218' 'C219' 'C220' 'C221' 'C222' 'C223' 'C224' 'C225' 'C226' 'C227'
 'C228' 'C229' 'C230' 'C231' 'C232' 'C233' 'C234' 'C235' 'C236' 'C237'
 'C238' 'C239' 'C240' 'C241' 'C242' 'C243' 'C244' 'C245' 'C246' 'C247'
 'C248' 'C249' 'C250' 'C251' 'C252' 'C253' 'C254' 'C255' 'C256' 'C257'
 'C258' 'C259' 'C260' 'C261' 'C262' 'C263' 'C264' 'C265' 'C266' 'C267'
 'C268' 'C269' 'C270' 'C271' 'C272' 'C273' 'C274' 'C275' 'C276' 'C277'
 'C278' 'C279' 'C280' 'C281' 'C282' 'C283' 'C284' 'C285' 'C286' 'C287'
 'C288' 'C289' 'C290' 'C291' 'C292' 'C293' 'C294' 'C295' 'C296' 'C297'
 'C298' 'C299' 'C300' 'C301' 'C302' 'C303' 'C304' 'C305' 'C306' 'C307'
 'C308' 'C309' 'C310' 'C311' 'C312' 'C313' 'C314' 'C315' 'C316' 'C317'
 'C318' 'C319' 'C320' 'C321' 'C322' 'C323' 'C324' 'C325' 'C326' 'C327'
 'C328' 'C329' 'C330' 'C331' 'C332' 'C333' 'C334' 'C335' 'C336' 'C337'
 'C338' 'C339' 'C340' 'C341' 'C342' 'C343' 'C344' 'C345' 'C346' 'C347'
 'C348' 'C349' 'C350' 'C351' 'C352' 'C353' 'C354' 'C355' 'C356' 'C357'
 'C358' 'C359' 'C360' 'C361' 'C362' 'C363' 'C364' 'C365' 'C366' 'C367'
 'C368' 'C369' 'C370' 'C371' 'C372' 'C373' 'C374' 'C375' 'C376' 'C377'
 'C378' 'C379' 'C380' 'C381' 'C382' 'C383' 'C384' 'C385' 'C386' 'C387'
 'C388' 'C389' 'C390' 'C391' 'C392' 'C393' 'C394' 'C395' 'C396' 'C397'
 'C398' 'C399' 'C400' 'C401' 'C402' 'C403' 'C404' 'C405' 'C406' 'C407'
 'C408' 'C409' 'C410' 'C411' 'C412' 'C413' 'C414' 'C415' 'C416' 'C417'
 'C418' 'C419' 'C420' 'C421' 'C422' 'C423' 'C424' 'C425' 'C426' 'C427'
 'C428' 'C429' 'C430' 'C431' 'C432' 'C433' 'C434' 'C435' 'C436' 'C437'
 'C438' 'C439' 'C440' 'C441' 'C442' 'C443' 'C444' 'C445' 'C446' 'C447'
 'C448' 'C449' 'C450' 'C451' 'C452' 'C453' 'C454' 'C455' 'C456' 'C457'
 'C458' 'C459' 'C460' 'C461' 'C462' 'C463' 'C464' 'C465' 'C466' 'C467'
 'C468' 'C469' 'C470' 'C471' 'C472' 'C473' 'C474' 'C475' 'C476' 'C477'
 'C478' 'C479' 'C480' 'C481' 'C482' 'C483' 'C484' 'C485' 'C486' 'C487'
 'C488' 'C489' 'C490' 'C491' 'C492' 'C493' 'C494' 'C495' 'C496' 'C497'
 'C498' 'C499' 'C500' 'C501' 'C502' 'C503' 'C504' 'C505' 'C506' 'C507'
 'C508' 'C509' 'C510' 'C511' 'C512' 'C513' 'C514' 'C515' 'C516' 'C517'
 'C518' 'C519' 'C520' 'C521' 'C522' 'C523' 'C524' 'C525' 'C526' 'C527'
 'C528' 'C529' 'C530' 'C531']
---------------------------------------------------

In [59]:
Customer_and_bank_details_p1.describe()

        Customer_id           age
count  37084.000000  37084.000000
mean   18542.500000     40.042714
std    10705.373028     10.432965
min        1.000000     17.000000
25%     9271.750000     32.000000
50%    18542.500000     38.000000
75%    27813.250000     47.000000
max    37084.000000     98.000000

In [60]:
Customer_and_bank_details_p1.isnull().sum()

Customer_id    0
age            0
job            0
marital        0
education      0
default        0
housing        0
loan           0
Region_Code    0
State_Code     0
City_Code      0
dtype: int64

In [61]:
Customer_campaign_details_p1.head(3)

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome
0,1,telephone,may,mon,307,1,999,0,nonexistent
1,2,telephone,may,mon,198,1,999,0,nonexistent
2,3,telephone,may,mon,139,1,999,0,nonexistent

In [62]:
for column in Customer_campaign_details_p1.columns:
	print(column," ",Customer_campaign_details_p1[column].unique())
	print("---------------------------------------------------")

Customer_id   [    1     2     3 ... 37082 37083 37084]
---------------------------------------------------
contact   ['telephone' 'cellular']
---------------------------------------------------
month   ['may' 'jun' 'jul' 'aug' 'oct' 'nov' 'dec' 'mar' 'apr' 'sep']
---------------------------------------------------
day_of_week   ['mon' 'tue' 'wed' 'thu' 'fri']
---------------------------------------------------
duration   [ 307  198  139 ... 1246 1556 1868]
---------------------------------------------------
campaign   [ 1  2  3  4  5  6  7  8  9 10 11 12 13 19 18 23 14 22 25 16 17 15 20 56
 39 35 42 28 26 27 32 21 24 29 31 30 41 37 40 33 34 43]
---------------------------------------------------
pdays   [999   6   4   3   5   1   0  10   7   8   9  11   2  12  13  14  15  16
  21  17  18  22  25  26  19  27  20]
---------------------------------------------------
previous   [0 1 2 3 4 5 6 7]
---------------------------------------------------
poutcome   ['nonexistent' 'failure' 'success']
---------------------------------------------------

In [63]:
Customer_campaign_details_p1.describe()

        Customer_id      duration      campaign         pdays      previous
count  37084.000000  37084.000000  37084.000000  37084.000000  37084.000000
mean   18542.500000    258.237946      2.569545    962.530849      0.172986
std    10705.373028    258.730909      2.770611    186.773063      0.495681
min        1.000000      0.000000      1.000000      0.000000      0.000000
25%     9271.750000    102.000000      1.000000    999.000000      0.000000
50%    18542.500000    180.000000      2.000000    999.000000      0.000000
75%    27813.250000    319.250000      3.000000    999.000000      0.000000
max    37084.000000   4918.000000     56.000000    999.000000      7.000000

In [64]:
Customer_campaign_details_p1.isnull().sum()

Customer_id    0
contact        0
month          0
day_of_week    0
duration       0
campaign       0
pdays          0
previous       0
poutcome       0
dtype: int64

Starting to merge all the different datasets into one big dataset

In [65]:
data = pd.merge(Customer_campaign_details_p1,Customer_and_bank_details_p1 , on='Customer_id', how='outer')
data.head(3)

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
0,1,telephone,may,mon,307,1,999,0,nonexistent,56,services,married,high.school,no,no,yes,3,S1,C1
1,2,telephone,may,mon,198,1,999,0,nonexistent,45,services,married,basic.9y,unknown,no,no,3,S1,C1
2,3,telephone,may,mon,139,1,999,0,nonexistent,59,admin.,married,professional.course,no,no,no,4,S2,C2

In [66]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()

Y['y'] = encoder.fit_transform(Y['y'])
Y

       Customer_id  y
0                1  0
1                2  0
2                3  0
3                4  0
4                5  0
...            ... ..
37079        37080  1
37080        37081  0
37081        37082  0
37082        37083  1
37083        37084  0

[37084 rows x 2 columns]

In [68]:
Customer_Postal_Code_detail.head(3)

   customer_id  Postal Code
0            1        42420
1            2        42420
2            3        90036

In [69]:
Customer_Postal_Code_detail.rename(columns={'customer_id': 'Customer_id'}, inplace=True)

In [70]:
Customer_Postal_Code_detail.head(3)

   Customer_id  Postal Code
0            1        42420
1            2        42420
2            3        90036

In [71]:
Customer_Postal_Code_detail.isnull().sum()

Customer_id    0
Postal Code    0
dtype: int64

In [72]:
for column in Customer_Postal_Code_detail.columns:
	print(column," ",Customer_Postal_Code_detail[column].unique())
	print("---------------------------------------------------")

Customer_id   [    1     2     3 ... 37082 37083 37084]
---------------------------------------------------
Postal Code   [42420 90036 33311 90032 28027 98103 76106 53711 84084 94109 68025 19140
 84057 90049 77095 75080 77041 60540 32935 55122 48185 19901 47150 10024
 12180 90004 60610 85234 22153 10009 49201 38109 77070 35601 94122 27707
 60623 29203 55901 55407 97206 55106 80013 28205 60462 10035 50322 43229
 37620 19805 61701 85023 95661 64055 91104 43055 53132 85254 95123 98105
 98115 73034 90045 19134 88220 78207 77036 62521 71203  6824 75051 92374
 45011  7090 19120 44312 80219 75220 37064 90604 48601 44256 43017 48227
 38401 33614 95051 55044 92037 77506 94513 27514  7960 45231 94110 90301
 33319 80906  7109 48180  8701 22204 80004  7601 33710 19143 90805 92345
 37130 84041 78745  1852 31907  6040 78550 85705 62301  2038 33024 98198
 61604 89115  2886 33180 28403 92646 40475 80027  1841 39212 48187 10801
 28052 32216 47201 13021 73071 94521 60068 79109 11757 90008 92024 77340
 14609 72701 92627 80134 30318 64118 59405 48234 33801 36116 85204 60653
 54302 45503 92804 98270 97301 78041 75217 43123 10011 48126 31088 94591
 92691 48307  7060 85635 98661 60505 76017 40214 75081 44105 75701 27217
 22980 19013 27511 32137 10550 48205 33012 11572 92105 60201 48183 55016
 71111 50315 93534 23223 28806 92530 68104 98026 92704 53209 41042 44052
  7036 93905  8901 17602  3301 21044 75043  6360 22304 43615 87401 92503
 90503 78664 92054 33433 23464 92563 28540 52601 98502 20016 65109 63376
 61107 33142 78521 10701 94601 28110 20735 30076 72401 47374 94509 33030
 46350 48911 44221 89502 22801 92025 48073 20852 33065 14215 33437 39503
 93727 27834 11561 35630 31204 52402  2908 81001 94533 32725 42071  6457
 11520 90660 84604 84062 30080 24153 44134 36608  2740 75061  8360 85301
 14304 27360 92683 38301 75019 91767 89031 18103 19711 85281 92677  8302
  2149 13601 54915 98006 75002 79907 76051 75007 37167 98031 70506 97224
 60076 75023 23434 46203  7002 28314 27405 21215 53142 66062 98002 74133
 97756 27604 74403  6450 42104 46614  6010 89015 99207 76248 45014 32127
 97504 22901 59801 33178 29501 97477 32712 19601 80020 65807  7501 73120
 23320 79424 65203 37604 36830 92404  1453 59715 85345 44107  8861 91761
 91730 56560 75150 95207 32174 94086  3820 17403 77840 63116  2169 95336
 44240 76903 84106 35810 37918 72209 48146 43302 80122  5408  4401 38671
 47362 48640 57103 80525 47905 37042 95823 91360  2148  1040 87105 89431
 92236 60126  7055 29406 23602 14701 46544 43402 92253 32303 37211 98226
 60098 76117 60090 29483 71901 80112 43130 88001 35244 75034 95687 84107
 53186 93309 33068 45373 78415 90278 32839  7050 70601 60035 11550 46060
 55124 29464 48310 54703 78577 59102 97030 37421 83642 92307 60440 55369
 95695 77489 77581 94403 49505 93277 66212 92592 92399  2151 77301 60477
 52001 48127 87505 28601 60188 56301 33161 46226 33317 34952 29730 79762
 53214 91911 66502 16602 80229 61821 47401 71854 78539 77520 46142 90712
  2895 54880 76021 98042 74012 33023 33021 77536 67212 78501 52240 83704
  2920 61032 77642 95610 75056 98052 32114 86442 46368 58103 46514 91776
 33063 30328 44060 73505 23666 13440 54601 83501 39401 94526 48858 84321
  6708 30605  4240 61832 85323 30062 85364 54401 99301 60302 32503 77573
 20877 84043 35401 92553 40324 80538 85224 59601 63122 76706 48066 60423
 18018 55113 68801 55125 48237 72756 88101 33458 93101 75104 68701 84020
 48104 91941 83201 49423  6460 60089 92630 96003 95928 13501 72032 82001
 42301 83605 70065  3060 38134 94061 37087 93454 60016 98632 37075 50701
  2138 60067  1915 97405 93030 98059 60025 33445 80022 77590 27893 87124
 27534 98208 90640 92020 77705 33407 79605 61761 63301 60174 93010 97123
 91505 95351 67846  8401 80501 95616 26003 95037  7011 53081 30344 57701
  1810 34741  6484  6810 52302 32771 78666 80634 76063 44035 83301 33134
 60441  1752 20707 77803 71603 57401 21740  7017 60004 60543 55433 92672
 94568 93405 72762 95240 77571 45040 30188]
---------------------------------------------------

In [74]:
data = pd.merge(data,Customer_Postal_Code_detail, on='Customer_id', how='outer')
data.head(5)

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code,Postal Code
0,1,telephone,may,mon,307,1,999,0,nonexistent,56,services,married,high.school,no,no,yes,3,S1,C1,42420
1,2,telephone,may,mon,198,1,999,0,nonexistent,45,services,married,basic.9y,unknown,no,no,3,S1,C1,42420
2,3,telephone,may,mon,139,1,999,0,nonexistent,59,admin.,married,professional.course,no,no,no,4,S2,C2,90036
3,4,telephone,may,mon,217,1,999,0,nonexistent,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3,33311
4,5,telephone,may,mon,380,1,999,0,nonexistent,24,technician,single,professional.course,no,yes,no,3,S3,C3,33311

In [75]:
Customer_social_economic_data_p1

,Customer_id,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
0,1,1.1,93.994,-36.4,4.857,5191.0
1,2,1.1,93.994,-36.4,4.857,5191.0
2,3,1.1,93.994,-36.4,4.857,5191.0
3,4,1.1,93.994,-36.4,4.857,5191.0
4,5,1.1,93.994,-36.4,4.857,5191.0
...,...,...,...,...,...,...
37079,37080,-1.1,94.767,-50.8,1.028,4963.6
37080,37081,-1.1,94.767,-50.8,1.028,4963.6
37081,37082,-1.1,94.767,-50.8,1.028,4963.6
37082,37083,-1.1,94.767,-50.8,1.028,4963.6
37083,37084,-1.1,94.767,-50.8,1.028,4963.6

In [76]:
Customer_social_economic_data_p1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37084 entries, 0 to 37083
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_id     37084 non-null  int64
 1   emp.var.rate    37084 non-null  float64
 2   cons.price.idx  37084 non-null  float64
 3   cons.conf.idx   37084 non-null  float64
 4   euribor3m       37084 non-null  float64
 5   nr.employed     37084 non-null  float64
dtypes: float64(5), int64(1)
memory usage: 1.7 MB

In [78]:
Customer_social_economic_data_p1.isnull().sum()

Customer_id       0
emp.var.rate      0
cons.price.idx    0
cons.conf.idx     0
euribor3m         0
nr.employed       0
dtype: int64

In [79]:
for column in Customer_social_economic_data_p1.columns:
	print(column," ",Customer_social_economic_data_p1[column].unique())
	print("---------------------------------------------------")

Customer_id   [    1     2     3 ... 37082 37083 37084]
---------------------------------------------------
emp.var.rate   [ 1.1  1.4 -0.1 -0.2 -1.8 -2.9 -3.4 -3.  -1.7 -1.1]
---------------------------------------------------
cons.price.idx   [93.994 94.465 93.918 93.444 93.798 93.2   92.756 92.843 93.075 92.893
 92.963 92.469 92.201 92.379 92.431 92.649 92.713 93.369 93.749 93.876
 94.055 94.215 94.027 94.199 94.601 94.767]
---------------------------------------------------
cons.conf.idx   [-36.4 -41.8 -42.7 -36.1 -40.4 -42.  -45.9 -50.  -47.1 -46.2 -40.8 -33.6
 -31.4 -29.8 -26.9 -30.1 -33.  -34.8 -34.6 -40.  -39.8 -40.3 -38.3 -37.5
 -49.5 -50.8]
---------------------------------------------------
euribor3m   [4.857 4.856 4.855 4.859 4.86  4.858 4.864 4.865 4.866 4.967 4.961 4.959
 4.958 4.96  4.962 4.955 4.947 4.956 4.966 4.963 4.957 4.968 4.97  4.965
 4.964 5.045 5.    4.936 4.921 4.918 4.912 4.827 4.794 4.76  4.733 4.7
 4.663 4.592 4.474 4.406 4.343 4.286 4.245 4.223 4.191 4.153 4.12  4.076
 4.021 3.901 3.879 3.853 3.816 3.743 3.669 3.563 3.488 3.329 3.282 3.053
 1.811 1.799 1.778 1.757 1.726 1.703 1.687 1.663 1.65  1.64  1.629 1.614
 1.602 1.584 1.574 1.56  1.556 1.548 1.538 1.531 1.52  1.51  1.498 1.483
 1.479 1.466 1.453 1.445 1.435 1.423 1.415 1.41  1.405 1.406 1.4   1.392
 1.384 1.372 1.365 1.354 1.344 1.334 1.327 1.313 1.299 1.291 1.281 1.266
 1.25  1.244 1.259 1.264 1.27  1.262 1.26  1.268 1.286 1.252 1.235 1.224
 1.215 1.206 1.099 1.085 1.072 1.059 1.048 1.044 1.029 1.018 1.007 0.996
 0.979 0.969 0.944 0.937 0.933 0.927 0.921 0.914 0.908 0.899 0.884 0.883
 0.881 0.879 0.873 0.869 0.861 0.859 0.854 0.851 0.849 0.843 0.838 0.834
 0.829 0.825 0.821 0.819 0.813 0.809 0.803 0.797 0.788 0.781 0.778 0.773
 0.771 0.77  0.768 0.766 0.762 0.755 0.749 0.743 0.741 0.739 0.75  0.753
 0.754 0.752 0.744 0.74  0.742 0.737 0.735 0.733 0.73  0.731 0.728 0.724
 0.722 0.72  0.719 0.716 0.715 0.714 0.718 0.721 0.717 0.712 0.71  0.709
 0.708 0.706 0.707 0.7   0.655 0.654 0.653 0.652 0.651 0.65  0.649 0.646
 0.644 0.643 0.639 0.637 0.635 0.636 0.634 0.638 0.64  0.642 0.645 0.659
 0.663 0.668 0.672 0.677 0.682 0.683 0.684 0.685 0.688 0.69  0.692 0.695
 0.697 0.699 0.701 0.702 0.704 0.711 0.713 0.723 0.727 0.729 0.732 0.748
 0.761 0.767 0.782 0.79  0.793 0.802 0.81  0.822 0.827 0.835 0.84  0.846
 0.87  0.876 0.885 0.889 0.893 0.896 0.898 0.9   0.904 0.905 0.903 0.895
 0.894 0.891 0.89  0.888 0.886 0.882 0.88  0.878 0.877 0.942 0.953 0.956
 0.959 0.965 0.972 0.977 0.982 0.985 0.987 0.993 1.    1.008 1.016 1.025
 1.032 1.037 1.043 1.045 1.05  1.049 1.046 1.041 1.04  1.039 1.035 1.03
 1.031 1.028]
---------------------------------------------------
nr.employed   [5191.  5228.1 5195.8 5176.3 5099.1 5076.2 5017.5 5023.5 5008.7 4991.6
 4963.6]
---------------------------------------------------

In [81]:
data = pd.merge(data,Customer_social_economic_data_p1, on='Customer_id', how='outer')
data

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,age,...,emp.var.rate_x,cons.price.idx_x,cons.conf.idx_x,euribor3m_x,nr.employed_x,emp.var.rate_y,cons.price.idx_y,cons.conf.idx_y,euribor3m_y,nr.employed_y
0,1,telephone,may,mon,307,1,999,0,nonexistent,56,...,1.1,93.994,-36.4,4.857,5191.0,1.1,93.994,-36.4,4.857,5191.0
1,2,telephone,may,mon,198,1,999,0,nonexistent,45,...,1.1,93.994,-36.4,4.857,5191.0,1.1,93.994,-36.4,4.857,5191.0
2,3,telephone,may,mon,139,1,999,0,nonexistent,59,...,1.1,93.994,-36.4,4.857,5191.0,1.1,93.994,-36.4,4.857,5191.0
3,4,telephone,may,mon,217,1,999,0,nonexistent,41,...,1.1,93.994,-36.4,4.857,5191.0,1.1,93.994,-36.4,4.857,5191.0
4,5,telephone,may,mon,380,1,999,0,nonexistent,24,...,1.1,93.994,-36.4,4.857,5191.0,1.1,93.994,-36.4,4.857,5191.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37079,37080,cellular,nov,fri,334,1,999,0,nonexistent,73,...,-1.1,94.767,-50.8,1.028,4963.6,-1.1,94.767,-50.8,1.028,4963.6
37080,37081,cellular,nov,fri,383,1,999,0,nonexistent,46,...,-1.1,94.767,-50.8,1.028,4963.6,-1.1,94.767,-50.8,1.028,4963.6
37081,37082,cellular,nov,fri,189,2,999,0,nonexistent,56,...,-1.1,94.767,-50.8,1.028,4963.6,-1.1,94.767,-50.8,1.028,4963.6
37082,37083,cellular,nov,fri,442,1,999,0,nonexistent,44,...,-1.1,94.767,-50.8,1.028,4963.6,-1.1,94.767,-50.8,1.028,4963.6
37083,37084,cellular,nov,fri,239,3,999,1,failure,74,...,-1.1,94.767,-50.8,1.028,4963.6,-1.1,94.767,-50.8,1.028,4963.6

In [82]:
data.describe()

,Customer_id,duration,campaign,pdays,previous,age,Postal Code,emp.var.rate_x,cons.price.idx_x,cons.conf.idx_x,euribor3m_x,nr.employed_x,emp.var.rate_y,cons.price.idx_y,cons.conf.idx_y,euribor3m_y,nr.employed_y
count,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000,37084.000000
mean,18542.500000,258.237946,2.569545,962.530849,0.172986,40.042714,55202.625553,0.082669,93.576076,-40.505183,3.621668,5167.058664,0.082669,93.576076,-40.505183,3.621668,5167.058664
std,10705.373028,258.730909,2.770611,186.773063,0.495681,10.432965,32057.300954,1.568997,0.578493,4.622045,1.733972,72.196605,1.568997,0.578493,4.622045,1.733972,72.196605
min,1.000000,0.000000,1.000000,0.000000,0.000000,17.000000,1040.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
25%,9271.750000,102.000000,1.000000,999.000000,0.000000,32.000000,23223.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
50%,18542.500000,180.000000,2.000000,999.000000,0.000000,38.000000,56301.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,27813.250000,319.250000,3.000000,999.000000,0.000000,47.000000,90008.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,37084.000000,4918.000000,56.000000,999.000000,7.000000,98.000000,99301.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000,1.400000,94.767000,-26.900000,5.045000,5228.100000